{
  "slug": "htcendroll04",
  "title": "数字でデザインするエンドロールの作り方 04",
  "date": "2023年1月22日",
  "category": "blog",
  "excerpt": "最後はスタッフのクレジット作成です。 キャストと異なる点は、スタッフは名前と役職がペアになっているところです。しかし、これも1行に2名の時と同じ考え方で問題ありません。 今回は、役職名とスタッフ名のフォントを同じ大きさにします。 ＊このページのすべての画像はクリックで拡大表示されます。",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "最後はスタッフのクレジット作成です。 キャストと異なる点は、スタッフは名前と役職がペアになっているところです。しかし、これも1行に2名の時と同じ考え方で問題ありません。 今回は、役職名とスタッフ名のフォントを同じ大きさにします。 ＊このページのすべての画像はクリックで拡大表示されます。\n\nプロデューサーからラインプロデューサーのメインスタッフを揃えましょう。揃え方は、2 から３の記事までと同じなので省略します。 スタッフゾーンの最初にSTAFFを水平方向中央に置きます。その下に来るスタッフ名との間隔は50px にします。役職名（プロデューサー）の位置を935px, 石橋湛山を985px に位置させて、二つを垂直方向中央に整列させます。 ＊なぜ 935px, 985px にするのかは「 数字でデザインするエンドロールの作り方 03 」を参考にしてください。\n\n役職名の右端を「プロデューサー」に合わせて整列させます。次に、行の間隔を18px 垂直方向等間隔に分布します。 次に「プロデューサー」と「石橋湛山」を垂直方向中央に整列させたあと、スタッフ名を「石橋湛山」の左端合わせに整列させます。 最後は各役職名を中心にスタッフ名と垂直方向中央で整列させます。 終わったらメインスタッフをグループ化しましょう。\n\nグループ化したメインスタッフと俳優クレジットの最後、鳩山一郎との間隔を540px 空けます。\n\n同じように助手グループも揃えます。監督助手から制作進行までです。\n\n役職が一つにスタッフが2名いるところの横の間隔は18px にします。例えば、撮影助手の村山富市と鈴木貫太郎の間など。 メインスタッフと助手の間隔は135px にしました。このあたりはお好みで。\n\n応援スタッフも揃え方は同じですね。助手グループと応援グループの間隔は68px にしました。\n\nここまで来れば、あと少しです。\n\nもう監督までサッと並べられるようになったのではないでしょうか。 「応援スタッフ」グループから「配給・制作プロダクション」までは一律 135px ずつ空けることにしました。 制作プロダクションと監督の間隔は1080px 空けます。監督の名前だけ単独で画面に出るようにします。 ここまでで、クレジットを並べる作業は終わりました。\n\nIllustrator 左横の数値を見てみますと、高さ6500px あたりまで使っていることがわかります。（「伊藤博文」を選択し、プロパティタブのＹの座標を確認したほうが正確です） 監督クレジットからさら下に１画面分の黒地を残します。 今回では6500 + 1080 = 7580px。キリのいいところで、7600px をこのクレジット全体の高さとします。 アートボードを編集して、高さを7600px に変更しましょう。\n\n1. 「ファイル」メニューから「ドキュメント設定」をクリック 2. ドキュメント設定ウインドウの「アートボードを編集」をクリック 3. プロパティタブで基準点を中央上に変更したあと、高さ（H）に 7600 と入力します。 基準点を真ん中のままだと、上下から均等に短くされてしまいます。せっかく最初の画面を黒地にしていたのに、やり直しになってしまうので、注意してください。\n\n黒の下地も7600px にしましょう。 1. レイヤーパネルの「下地」レイヤーのロックを外します\n\n2. 「ツールバー」から「選択ツール」を選び黒い下地をクリック 3. 「変形」パネルで基準点を上の真ん中にする 4. 「変形」パネルのH の値を7600px にする\n\n終わったら黒地レイヤーをロックしてください。 これで完成です。\n\nところでエンドロールの最後ってどうしていますか？ だいたい最後は監督が単独で出てきますが、２つパターンがありますね。 上までスクロールさせて最後は真っ黒の画面で終わるパターンと、監督の名前を画面の真ん中で止めてフェードアウトさせるパターン。 テレビドラマの映画化など制作会社や監督がテレビ畑出身の人は真ん中で止める。映画畑出身の監督は上までスクロールさせている傾向があるようです。\n\n閑話休題、完成したファイルは、Premiere Pro, After Effects ならこのままai ファイルを、それ以外のアプリで使う場合は、JPEGやPNGなどで書き出して使います。 書き出し方法は以下の通りです。今回はPNG形式で書き出します。\n\n1. Illustrator の「ファイル」メニューから「書き出し」→「書き出し形式」をクリック\n\n2. 「書き出し」ウインドウが表示されます。保存したい場所とファイル名を指定、「ファイル形式」はPNG(png) にして「書き出し」ボタンをクリック。（＊今回はファイル名を「映画風エンドロール.png」としました）\n\n3. 「PNGオプション」設定は「オプション」が解像度：スクリーン(72dpi)\n\n4. 「アンチエイリアス」は文字に最適（ヒント）\n\n5. インターレースにチェックは入れない\n\n6. 「プレビュー」の背景色は透明\n\n7. 「OK」ボタンをクリック\n\n以上でエンドロール用キャスト＆スタッフクレジット画像が完成です。お疲れさまでした。 このあと、お使いの動画編集アプリにこの画像を読み込ませて、下から上にスクロールさせましょう。 監督を上までスクロールさせる人は消えるまで、画面中央で止めたい人はそのように。 数字でデザインするエンドロールの作り方は以上です。 今回作成したスタッフ＆キャストクレジットをエンディングでロールさせている動画をYouTube にアップしました。エンドロール開始10秒前から始まっています。 ご参考ください。\n\nロッコービデオサービスでは、オンラインでの動画編集レッスンを行っています。動画編集ソフトの基本的な操作、無意識に働きかける演出のアドバイスなどを教えます。 ひとりひとりのレベルにあった個別指導なので、スキルアップに最適です。録画もできるので、繰り返し練習することも可能です。\n\nあなたの想いを、編集の魔法で輝かせる 動画編集を学びたい！そう思っているあなたは、動画編集の大切さ、面白さを無意識に気づいている人です。編集こそが、あなたの想い…\n\n＜前回までの「数字でデザインするエンドロールの作り方」＞ 数字でデザインするエンドロールの作り方 01 ～準備～ 数字でデザインするエンドロールの作り方02 ～文字の整列～ 数字でデザインするエンドロールの作り方03 ～グループを使う～",
  "tags": []
}