{
  "slug": "moana",
  "title": "『モアナと伝説の海』『塔の上のラプンツェル』右向きの希望 、左向きの危険 | 進行方向が物語を決める",
  "date": "2022年6月28日",
  "category": "blog",
  "excerpt": "映像作品、特に映画は構図や登場人物またはカメラの動き、照明などで観客の無意識に働きかけ感情を操る技術があります。 当ブログでは、DVDや配信サービスで視聴しやすい作品で使われているそれらの効果を取り上げます。 そのためストーリーを最後まで書いていることがあります。ご了承ください。",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "映像作品、特に映画は構図や登場人物またはカメラの動き、照明などで観客の無意識に働きかけ感情を操る技術があります。 当ブログでは、DVDや配信サービスで視聴しやすい作品で使われているそれらの効果を取り上げます。 そのためストーリーを最後まで書いていることがあります。ご了承ください。\n\n今回は主人公が左右のどっちの方向に進んでいるか、についてです。 よく考えられている映画では、主人公の進む向きで、その時点での主人公の感情や置かれている状況がポジティブなのかネガティブなのかがわかるようになっています。特にディズニー映画で顕著です。\n\nディズニー映画では、主人公が右に移動している（右を向いている）ときはストーリーを先に進めている状況、もしくは主人公がポジティブな感情になっています。左に移動している（左を向いている）ときは、その反対や目的地から戻る時などです。 『モアナと伝説の海』は進行方向を演出に取り入れていることが分かりやすい作品です。\n\n島で生まれ育ち、サンゴ礁を超えてはいけない、と教えられ育った主人公・モアナはサンゴ礁を超えた先、海の向こうの世界に強い憧れを抱きます。自分の望みを叶えようと前進する時、モアナは常に画面の右側に向かって進みます。それを拒もうとする父トゥイはモアナの右側に立ちふさがり、画面左側に連れ戻します。 サンゴ礁を超えたモアナ。彼女の目的である女神テ・フィティに＜心＞を返しに行く時も右に右に進みます。 また、登場人物が自身の過去を振り返る時は画面の左側を向きます。マウイが過去を語る時、マウイも彼の話を親身になって聞くモアナも左を向いています。その後、マウイが立ち直ると同時に夜が明け、二人は右を向いて再び進み始めます。\n\nこのように主人公の状況や心境が、左右のどっちを向いているかで分かるように設計されています。だから主人公がハッピーなのに左側に進んでいるときは、直後に悪い事が起きる前触れかもしれません。ほんの少しストーリーの先を読めるようになりますね。\n\nただ『モアナと伝説の海』のクライマックスの一番重要なシーン。モアナがテ・カァの胸に＜心＞をはめ込み、テ・フィティに姿が戻るところだけ、テ・フィティが右側を向いていて、モアナは左側を向いています。これはどう解釈すればいいのでしょう？ このシーンはテ・フィティが主役だから右側を向かせて、モアナは過去を清算するから左側を向いているのでしょうか？？？\n\nみなさんはどう思われますか？ こういうことで友達と意見を交わすのも映画の楽しみ方のひとつです。\n\nと、ここまで映画の進行方向についてお話してきました。よく考えられている映画は、主人公がストーリーを進めるとき、ポジティブな心境の時は画面右側に向かって進み、ピンチの時やネガティブな心境の時は左側に向かう。特にディズニー映画で顕著にみられる演出方法である。\n\nしかし『塔の上のラプンツェル』という映画は、全く正反対。主人公は常に左側に向かって進み、ピンチの際は右側を向いているのです。方向の演出が作品内で一貫しているというところでは、この２作品は共通しているのですが、なぜ方向が反対になったのでしょう？ ２作品には６年ほどの間隔があります（『ラプンツェル』2010年公開、『モアナ』2016年公開）。この間に何があったのでしょうか？ 私はすべてのディズニーアニメを把握していないので、その他の作品も見比べてみる必要がありそうですね。\n\nそして『モアナ』から６年後の今年２０２２年７月１日にディズニー傘下のピクサー作品『バズ・ライトイヤー』が公開されます。バズはいったいどっちに向かうのか？ 楽しみにしたいと思います。\n\n2022年7月12日追記 『塔の上のラプンツェル』が左に向かって進むのは、幼い頃に攫われた主人公ラプンツェルが王国に「戻る」ためだ、と結論づけました。 今のところは。",
  "tags": []
}