{
  "slug": "pentagonpapers",
  "title": "『ペンタゴン・ペーパーズ』 高低差で優劣を表す",
  "date": "2022年12月11日",
  "category": "blog",
  "excerpt": "実話をもとにした映画。 ベトナム戦争の泥沼化、勝てる見込みのない戦争に大勢の若者を戦場へ送り込みズブズブと沈んでいくアメリカ政府の様子を記録した米国防機密文書「ペンタゴン・ペーパーズ」をめぐる物語。文書の全容を明かそうとする人々と記事の差し止めを図るニクソン政権。 映画はワシントン・ポストのト...",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "実話をもとにした映画。 ベトナム戦争の泥沼化、勝てる見込みのない戦争に大勢の若者を戦場へ送り込みズブズブと沈んでいくアメリカ政府の様子を記録した米国防機密文書「ペンタゴン・ペーパーズ」をめぐる物語。文書の全容を明かそうとする人々と記事の差し止めを図るニクソン政権。 映画はワシントン・ポストのトップでアメリカ主要新聞社史上初の女性発行人キャサリン・グラハム（メリル・ストリープ）と編集主幹ベン・ブラッドリー（トム・ハンクス）ら報道側の人々の視点から、彼らの葛藤や駆け引きが描かれています。\n\n映画を観ていて、主人公であるワシントンポストの経営者メリル・ストリープの頭の位置（他の人物と画面上どっちの頭が高いところにあるか）で彼女の今の立場や感情を表しているように思えたので、４つのシーンを例に説明します。\n\nひとつ目は、メリル・ストリープとトム・ハンクスの朝食会のシーン。 二人の頭の高さは一緒。対等な関係にあると示されています。 実際は経営者のメリルのほうが雇用されているトムより上のはず。二人が同じ高さということは、メリルの弱さ、トムの強さが相まって対等な関係になっているということ。二人の会話の内容以外からもそれが分かります。 ズケズケとモノを言うトム編集長と、亡き夫に代わり、当時は一介の地方紙だった「ワシントンポスト」を経営するメリル。好きでこの仕事をしているわけではなく、なし崩し的に流されるまま来てしまった彼女は、いまいち自分に自信が持てないままでいます。\n\nふたつ目のシーン。 機密文書「ペンタゴン・ペーパーズ」に関する記事は、最初ニューヨークタイムズがスクープします。 ニューヨークタイムズがまだ持っていない文書の残りがほしいトムがメリルを使って手に入れようと考えます。メリルは文書作成の指示をしたマクナマラ長官と仲良し。 トムが説得のためメリルの自宅を訪問するシーン。 最初は押され気味のメリル。メリルがソファーに座り、トムが立ったまま話すので、トムのほうが高い。\n\n次のショットではさらに画面のすみっこで小さくなったメリル。 しかしメリルは反撃の糸口を見つけると……\n\nカメラは徐々にメリルへ寄っていき、自信のあるメリルのアップとなります。\n\n３つ目のシーン。 文書を手に入れたメリルが、そのことを告げにマクナマラ宅へ。 本題に入る前のマクナマラとメリルは同じ高さで画面に収まっています。\n\nしかし、メリルが記事にしようと思っていると告げると、マクナマラ長官は「ニクソン大統領がありとあらゆる手段を使ってワシントンポストを叩き潰す。記事にするのは止めろ」と非常に強い口調で警告します。まるで脅しのよう。 この時、マクナマラは立ち上がっていて、メリルはソファに座っています。メリルが先に立っていたマクナマラと同じ高さになろうとソファから腰を上げるタイミングでマクナマラが脅すので、メリルはたじろいでしまい立ち上がることができません。マクナマラは同じ高さになろうとしたメリルを許しませんでした。 一介の新聞社の社長は、国の最高権力を見上げることしかできない。\n\n最後。 結局、文書を掲載するところまでこぎつけたメリルとトム。しかし印刷の直前に、記事を掲載した新聞を発行するな、と役員たちに忠告されます。「会社がつぶれるぞ！」と。 座っているメリルに覆いかぶさるように役員たちは高い位置から圧力をかけます。トムがいくら強引に事を進めたくても、メリルのОKが出なければ新聞は発行されません。 早く印刷をしないと朝刊に間に合わない……\n\n彼女は役員たちの圧力に屈しません。毅然と自分の考えを役員たちに主張します。その時、彼女は立ち上がっています。彼女に賛成する役員は、一足お先に座り、彼女より一段低い位置に収まります。他の役員は全員立っています。 この中で一番背が低いメリル。それでも彼女が勝どきをあげる時、彼女とトムの二人がフレーム内で役員たちを抑えて高い位置にいます。僅差で最後まで粘っていた役員を抑えました。\n\nこんな感じです。 画面構図で観客の無意識に働きかける演出はそれほど珍しいものではありません。 ストーリーの面白さ、登場人物への感情移入といった要素以外にも映画の楽しみ方はあります。 登場人物の配置による演出がされているかどうか、少し気にしながら観てみるのもたまにはいいんじゃないでしょうか。",
  "tags": []
}