{
  "slug": "shotcuthowto02",
  "title": "無料の動画編集ソフト Shotcut の使い方 02 | 基礎編 1 | 取り込みからカット編集まで",
  "date": "2024年9月8日",
  "category": "blog",
  "excerpt": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…\n\nインストールが完了し、Shotcut の画面が表示されました。 最初に編集素材のデータを取り込みます。 ご自身の撮影データで練習するのが一番ですが、まだ持っていない人や私と同じデータで練習したいという人にデータをご用意しました。 下記よりダウンロードしてください。容量は300MB程度です。4つのMP4ファイル、2つのMOVファイル、2つのMTSファイル、1つのJPEGファイル、1つのMP3ファイルが入っています。 https://drive.google.com/uc?export=download&id=1_McwwhLgc2obMZQSRltDfk6Kc_OCYRkl ダウンロードしたファイルはZIPファイルというものです。編集で使う場合は、ZIPファイルをダブルクリックして開き、別にフォルダを作成して（例えばデスクトップに「練習用」など）、そこへコピーしたものを使ってください。これを「ZIPファイルを展開する」といいます。コピーした後はZIPファイルはゴミ箱へ。 この記事で使用しているすべてのデータはＣＣ０が適用されています。商用利用にも使えます。 CC0 について https://creativecommons.jp/sciencecommons/cc0-faq/\n\n編集で使うファイルを取り込みます。\n\n取り込みたいファイルを選択して「開く」。 今回は全部のファイルを選択して取り込みましょう。\n\n素材の取り込みが完了しました。今回はMP4、MOV、MTSなどの動画ファイルと、JPEG画像、音声のMP3ファイルを取り込みました。 いろいろなファイル形式の取り込みに対応していますね。\n\nここでいったんプロジェクトを保存しましょう。 画面上部のパネルより「保存」をクリック。\n\nプロジェクトのファイル名を決め、保存先のフォルダを選び「保存」。 保存はこまめに。少し作業したらすぐに保存するクセをつけましょう。泣かないために。\n\nShotcut の編集画面は大きく４つに分かれています。 左側が「プレイリスト」取り込んだファイルを管理する画面です。 プレイリストの下にタブがありますね。 「フィルタ」「プロパティ」も同じ画面で、タブをクリックすると表示が変わります。\n\n「フィルタ」は色補正やテキストを追加、フェードイン・アウト、画面を回転させるなど映像や音声に効果を加える操作をするところです。今はフィルタを使っていないので、何もない画面になっています。\n\n「プロパティ」は選択したクリップの詳細が確認できます。 複雑で細かな作業が必要になる編集作業の後半になってくると、なぜか重宝する項目です。\n\n真ん中は映像が再生されるビューワー画面です。 下には「ソース」「プロジェクト」のタブがあります。 「ソース」はプレイリストでダブルクリックした動画が表示・再生されます。 「ソース」画面で、クリップの使いたい部分の最初と最後を設定し、タイムラインに配置します。 「プロジェクト」タブでは、タイムラインを表示します。\n\n右の画面は「使用履歴」「操作履歴」が表示されます。 「使用履歴」の詳細は不明ですが、使用したファイルを記憶し、表示してくれているのだとおもいます。使うことはないでしょう。 「操作履歴」は操作（保存、トリミング、削除など）の履歴です。 かなり長い時間、自分を信じて操作したけどやっぱり間違っていたので、だいぶ以前にさかのぼってやり直したいゴメン、という時に使うのかな？ 通常は１つ～５つぐらいさかのぼるミスがほとんどで、それは画面上部の「元に戻す」を戻したい回数だけクリックすることで対応できます。 なので私は「使用履歴」「操作履歴」を表示させないことにします。\n\n「表示」メニューから「使用履歴」「操作履歴」をクリックすると消えます。 もし必要になったら同じように「表示」メニューからクリックすると現れます。\n\nそうすると画面右側に「音声ピークメーター」が表示されました。これは大事です。音声データが正常に取り込まれているか、再生されているか、音量が大きすぎて音割れしていないかなどの確認に使います。 が、いささか場所をとりすぎです。 私の画面ではピークメーターの、「-25」の左に白い点々が縦に並んでいるのが見えます。ここは画面と画面の境界線です。ここにカーソルを持っていって、マウスを押した状態（ドラッグ）で右に移動させましょう。\n\n音声ピークメーターが細くなり、ビューワー画面が広くなりました。 他の「ビューワ」「タイムライン」「プレイリスト」などの画面の境界線にも同じ点があります。これをドラッグすることでそれぞれの範囲を変更することができます。\n\n画面の下を支配しているのはタイムラインです。 ここに動画や音声ファイルを並べて、ひとつの作品を作ります。 下には「タイムライン」「キーフレーム」があります。 通常は「タイムライン」を表示させます。 編集が佳境に入って、高度な技術を使う時が「キーフレーム」の出番です。「キーフレーム」を一度も使うことなく編集が終わることもあります。初心者の方はまだ気にしなくていいです。\n\nでは、カット編集作業に進みましょう。 基礎編では、プレイリストから動画を選び、使いどころを決め、タイムラインに置くところまでです。\n\n「プレイリスト」に取り込んだファイル（クリップ）を上からすべて再生（プレビュー）します。 退屈に感じるかもしれませんが、すべてのショットに目を通すことで、どのような構成にするかが見えてきます。とても大事な作業なので必ずプレビューはしてください。 日本を代表する映画監督、小津安二郎の数々の代表作の編集を担当していた浜村義康は、「いかなる名人の編集技術も、繰り返し見ることには敵わない」と言っています。ハリウッド作品に関わる編集技師たちも「迷ったら、迷いが消えるまで何度も見直す」と言っています。 プレビューは編集作業に欠かせない工程だと思ってください。 今回、何度かプレビューした結果「女性のもとに男性が向かって、ふたりは落ち合い仲間たちとも合流。結婚式を挙げた」という物語になるように編集することにしました。\n\nクリップの使いどころを決めます。 001.pm4 をダブルクリックして「ソース」画面に表示します。 使いどころを決めます。 ビューワー画面の下、右向きの三角マークをクリックするか、キーボードのスペースキーを押すと再生されます。停止するときはもう一度押してください。 左右の矢印キー（←、→）を使えば、ひとコマずつ動きます。細かい調整は矢印キーを使いましょう。\n\n赤い足が画面に入ってくる少し前から使うことにしました。 キーボードの「I」キーを押すと、そこが使い始めの位置に設定されます（イン点と言います）。 次に使い終わりの場所（アウト点と言います）を設定します。 黄色いタクシーが消えたところをアウト点にしました。キーボードの「O」を押すとアウト点が設定されます。 ほぼ全ての動画編集ソフトでは、再生・停止はキーボードのスペースキー、イン点は「I」、アウト点は「O」で統一されています。覚えておきましょう。\n\nクリップの使いどころが決まったら、タイムラインにドラッグ・アンド・ドロップで配置します。初めてのクリップをドロップするとシーケンスが自動で作成されました。\n\nプレビューの結果、次は004.mp4 を使いたいと思いました。 先ほどと同様に、004をダブルクリックでビューワーに表示させ、ファイルの使いどころを決めてシーケンスに配置します。 ビューワー画面の「プロジェクト」タブをクリックしてください。タイムラインに配置したものが再生されます。あなたの意図通りになっているか確認しましょう。 「タイムライン」の再生ヘッドを再生させたい位置（今回は最初から確認したいので、一番左まで）ドラッグさせて再生します。\n\n最初のショットが少し長いかな……。 タイムライン上で短くしましょう。 正確に短くしたいので、タイムラインを拡大したいと思います。 「タイムラインの拡大」をクリックして見やすい大きさにしました。もとに戻すときは、マイナス虫メガネの「タイムラインの縮小」を使います。\n\n作業をしたいクリップをクリックすると赤枠で囲まれて選択状態になります。 今回は001のクリップのおしりを短くしたいので、クリップの右端にマウスを持っていき、←→ こんな矢印に代わったらドラッグしたまま左に。するとクリップが短くなりました。今回は１４フレーム短くしました。 二つのクリップの間に空白部分ができました。黄土色の箇所です。\n\n空白を埋める時は、黄土色の空白部分でマウスを右クリック。「リップル削除」を選びます。001と004のクリップがくっつきましたね。 操作を間違えたら、Shotcut 画面上部の「元に戻す」ボタンを押してやり直してください。\n\nこうやってクリップの使いどころを決め、次々とタイムラインに並べるのがカット編集です。 今回は練習なので先にクリップとクリップのつながり（カット点）の調整をしましたが、最初に使いたいクリップを順番にざっと並べたあとからカット点を調整したほうが作業が早いです。\n\nすべてのクリップをプレビューし、おおまかなカット編集を終わらせました。 タイムラインは画像のようになっています。\n\nこの時点でどういう編集になっているかをYouTube にアップしています。ご参考ください。音は入っていません。\n\n次回はテロップの追加について扱います。 夏場の水分補給と動画編集の保存はこまめに。\n\n3-1. テロップを追加する 前回までの Shotcut の使い方 カット編集が終わりました。次はテロップを入れます。ラストの教会のクリップに「終わり」と入れることにします。 …\n\n前回までの Shotcut の使い方 4-1. 音データをタイムラインへ 映像の編集はほぼ固まってきたので、音楽を入れてみます。最初から最後までずっと音楽が流れているようにし…\n\n前回までの Shotcut の使い方 最後の追い込みに入りましょう。エフェクト、トランジション、クリップの差し替えについてです。ここからがクリエイティブと呼ばれる領域だ…\n\n前回までの Shotcut の使い方 7-1. クリップの拡大と縮小 追加したクリップのうち、006 だけが他と解像度が異なっているため、上下に黒が出ています。通しで見ると違和感…",
  "tags": []
}