{
  "slug": "shotcuthowto03",
  "title": "無料の動画編集ソフト Shotcut の使い方 03 | 基礎編 2 | テロップの追加",
  "date": "2024年9月8日",
  "category": "blog",
  "excerpt": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…\n\n前回までの Shotcut の使い方 2-1. 取り込みと各画面の紹介 インストールが完了し、Shotcut の画面が表示されました。最初に編集素材のデータを取り込みます。ご自身の撮…\n\nカット編集が終わりました。 次はテロップを入れます。ラストの教会のクリップに「終わり」と入れることにします。\n\nプラス（＋）のボタンをクリック。 今後も何かしら映像や音に効果を追加したい（色を変えたい、回転させたい、音をフェードアウトさせたい、など）場合は「フィルタ」を追加から行います。覚えておきましょう。\n\nフィルタのリストより「リッチテキスト」を選びます。 「お気に入り」というところにありました。\n\nビューワー画面にテキストを入力するツールが表示されました。 「おわり」という文字をのせます。 画面に表示されている文字入力枠にダブルクリックしてから、テロップ用の文字を入力します。\n\n文字の設定項目は画像を参照してください。 ・フォント ・大きさ ・色 ・太字、イタリック、下線をつける などが設定できます。\n\n今回は、 ・ フォントを「游ゴシック」のイタリック ・ 色を黄色 ・ 大きさを170ポイント にしました。 文字入力の枠が大きいので、文字に合わせたいと思います。 枠の■をドラッグして調整してください。 文字の位置を移動させやすくなります。\n\n文字の入力枠を小さくしました。 文字の位置を変更するには、文字入力枠の中心にあるグレーの〇をドラッグ（マウスで左クリックしたままの状態）で動かすことができます。\n\n「フィルタ」タブの「位置」項目でも調整できます。左側が左右、右側が上下の調整です。細かい調整はここで。\n\n色々試してみてください。 失敗したら「元に戻す」でやり直せます。怖がらないで。\n\nラスト前の007 クリップにもテロップをのせたいです。 全然つながってないクリップでも… つなげると、つながるのだ！ この二つを同時ではなくタイミングをずらして出したい。 しかし、さきほどの方法では出来ないようです。 ひとつのクリップに２つのテロップを同じタイミングでのせることはできますが、タイミングがずれるのはダメみたい。\n\n別の方法でやりましょう。テロップをエフェクトとしてではなく、ひとつのクリップとしてタイムラインに配置します。\n\nタイムラインにテロップ用の映像トラックを追加します。 「タイムライン」の左上、三本線マークをクリックして「トラック操作」「映像トラックを追加」をクリックしてください。\n\n今までの映像トラック（V1）の上に新しいトラック（V2）が出来ました。\n\n次に画面上部の「その他を開く」パネルから「テキスト」をクリック。\n\nこのウインドウが表示されます。 何もせず「開く」をクリック。\n\n左側が「フィルタ」タブに移動しています。 右側のビューワーは「ソース」タブが表示されています。 「フィルタ」タブにある「映像」という項目の「テキスト：シンプル」をクリックすると、画面下にテキスト編集の各種項目が表示されます。\n\n「テキスト」欄に文字を入力します。\n\n文字を入れたら、とりあえずタイムラインにドラッグ・アンド・ドロップでテキストクリップを配置します。 テキストの枠の外の黒い部分を左クリック押しながらタイムラインに持っていって、クリックを離します。 V2トラックにテロップのクリップが配置されましたか？\n\n「フィルタ」タブで文字の大きさや色を変えましょう。 このテロップ作成方法では、文字にフチをつけることができます。 「輪郭」というパラメーターでフチの色を変えてみてください。 隣の「太さ」でフチの太さも変更できます。\n\nテロップを画面の中央に配置したい。そういう時は見た目で決めてもいいですが、正確に配置したほうがプロって感じがしますね。こだわっている感じが。 ビューワー画面の下、「グリッド表示の切り替え」ボタン右側の▼からいくつかのグリッドやセーフエリアが選べます。\n\n今回は４×４グリッドを使って中央に配置しました。\n\n文字の位置の細かい設定は「フィルタ」タブの「位置」パラメータで調整しましょう。左側が左右、右側が上下の項目です。 グリッドは、必要がなくなったら表示をオフにしましょう。「グリッド表示の切り替え」をもう一度クリックするとオフになります。 ちなみにグリッドは編集作業のためのガイド線です。有効にしたままでも、書き出した動画データには入りません。\n\n同様にもうひとつのテロップも作り、タイムラインに配置しました。 今回は文字の背景も使ってみました。\n\n次回は音データをタイムラインへ取り込み、簡単な調整を行います。\n\n前回までの Shotcut の使い方 4-1. 音データをタイムラインへ 映像の編集はほぼ固まってきたので、音楽を入れてみます。最初から最後までずっと音楽が流れているようにし…\n\n前回までの Shotcut の使い方 最後の追い込みに入りましょう。エフェクト、トランジション、クリップの差し替えについてです。ここからがクリエイティブと呼ばれる領域だ…\n\n前回までの Shotcut の使い方 6-1. 関係ない人に見てもらうことは大事 車のシーンの後ろにまだ使っていないクリップを２つ追加で入れたいと思いました。男女が水辺で向か…\n\n前回までの Shotcut の使い方 7-1. クリップの拡大と縮小 追加したクリップのうち、006 だけが他と解像度が異なっているため、上下に黒が出ています。通しで見ると違和感…",
  "tags": []
}