{
  "slug": "shotcuthowto05",
  "title": "無料の動画編集ソフト Shotcut の使い方 05 | 基礎編 4 | そしてクリエイティブと呼ばれる領域へ",
  "date": "2024年9月9日",
  "category": "blog",
  "excerpt": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…\n\n前回までの Shotcut の使い方 2-1. 取り込みと各画面の紹介 インストールが完了し、Shotcut の画面が表示されました。最初に編集素材のデータを取り込みます。ご自身の撮…\n\n3-1. テロップを追加する 前回までの Shotcut の使い方 カット編集が終わりました。次はテロップを入れます。ラストの教会のクリップに「終わり」と入れることにします。 …\n\n前回までの Shotcut の使い方 4-1. 音データをタイムラインへ 映像の編集はほぼ固まってきたので、音楽を入れてみます。最初から最後までずっと音楽が流れているようにし…\n\n最後の追い込みに入りましょう。エフェクト、トランジション、クリップの差し替えについてです。ここからがクリエイティブと呼ばれる領域だと私は思います。最後にちょっとした編集の考え方についても書きました。\n\n動画を再生して 気になったのは、テロップが二つのっているクリップ（007.mov）が長すぎること。 間を省略したいと思います。 男女が仲間のもとに到着してからキスまでのあいだが退屈なので省略しましょう。やり方は「再生ヘッドで分割」したあと、後半のクリップを短くし、空白になった部分を削除して、クリップをくっつけます。\n\nクリップの前半部分は画像にあるように、再生ヘッドの位置まで使うことにしました。 該当クリップを選択し「再生ヘッドで分割」。 ＊いま、画面の左側は「ファイルの書き出し」タブが表示されていますが、気にしないでください。みなさんは「プレイリスト」か「エフェクト」タブになっていると思います。しばらく左画面は使わないので、どのタブが表示されていても大丈夫です。\n\n後半は写真の再生ヘッドの位置から開始にします。 クリップ頭にカーソルを持っていき、カーソルの形が ←→ に変わったらドラッグして再生ヘッドの位置まで持っていきます。\n\n空白部分を右クリックで「リップル削除」。 後ろのクリップが前に移動し、くっつきましたね。\n\nテロップが変な位置になってしまいました。 ２番目のテロップは後半のキスシーンのクリップのおしり合わせにしました。 男女ふたりだけが楽しくて見ている方はダルい部分はカットされました。が、再生すると急に時間が飛んだようになってて、「ここって編集のミスかな？」 って思われるかも。それは癪なので、ディゾルブ（オーバーラップ）のトランジションをつけてごまかしましょう。\n\n後半のクリップをドラッグし、無理やり前に持っていきます。一部を重ねるように。 ふたつのクリップの間に砂時計のようなものが現れました。これがトランジションです。 砂時計を選択し「プロパティ」タブをクリックします。 トランジションのリストが表示されます。現在はディゾルブになっています。お好みのものを使ってください。 私はこのままディゾルブを使います。 ただ、もう少しディゾルブの長さがほしいかな、と思っています。 砂時計の左右をドラッグするとトランジションの長さが変更できます。\n\nトランジションのために 007.mov クリップを前に持ってきたせいで後ろに空白部分ができました。リップル削除します。\n\nするとテロップのおしりがはみ出てしまいました。テロップの右端をドラッグして長さを調整しました。\n\n次に気になったのが車内のハンドル（005.mov）です。 次の外から車を撮っているクリップと向きが逆になっていて、統一感がありません。 ハンドルのクリップを左右反転させましょう。\n\nタイムラインでハンドルのクリップを選択し「フィルタ」タブを表示。 「＋（フィルタを追加）」より「映像」のリストから「ミラー」をクリックします。\n\n「ミラー」を選んだ瞬間にフィルターが適用されました。 これで車の向きは一致しましたが、車内のディスプレイの文字も反転しています！ ほとんどの人は気づかないところなので、本当は無視してもいいのですが、粗探しに命をかけている人に見つかったら大変です！ せっかくの名作に傷がついてしまいます。 ここは同じクリップでディスプレイが映っていない箇所を探して差し替えましょう。\n\nプレイリストから005.mov をダブルクリックし、ビューワー画面でプレビューします。前半にディスプレイが映ってなく、反転させていることが気づかれない部分がありました。イン点、アウト点を設定して新しい使いどころを決めます。今回は冒頭から2秒あたりまでを使うことにします。\n\nいま「ソース」タブで設定し直したクリップを、タイムラインにあるクリップと差し替えます。 タイムラインの 005.mov クリップを選択し、右クリック「置換」を選んでください。\n\n新しいクリップに差し替えされています。しかも「ミラー」エフェクトも有効になっていて、再度エフェクト追加の操作をする手間が省けました。 これで車のシーンがブラッシュアップされました。 ＊「腕時計が右腕についているのは、この男性が左利きだから」と視聴者は思ってくれるはず。\n\nちなみに、車を外から撮影しているクリップを左右反転しなかったのはなぜだと思いますか？ そういう選択肢もありました。 車外のほうが左右を反転させてもバレないような気がしませんか？ でもそれはやってはいけない編集です。 その理由は、 車のシーンは画面右から左に向かわせなければいけないから です。 直前のシーンで、女性は画面の右を向いています。 わたしたちは、編集を始める前のプレビューの結果、今回の編集は、 「女性のもとに男性が向かって、ふたりは落ち合い仲間たちとも合流。結婚式を挙げた」 という物語にしようと決めました。 だとしたら、車を運転している男（毛むくじゃらの腕から男性だと視聴者は想像してくれます）は女性に会いに向かっているように思わせなければいけません。 次のクリップが左側（女性がいる方向）を向いていると、視聴者は無意識に女性に会いに向かっていると思うのです。このムービーはロマンスなのか？ と想像してくれます。 しかし車の進行方向を女性の顔と同じ右向きにしてしまうと、女性とは関係のない別のエピソードが始まるのかと視聴者は考えてしまいます。密接にくっつかなければいけない女と男のシーンがバラバラになってしまいます（さらに車の進行方向もバラバラ）。 登場人物の進行方向は、とても重要な要素です。セリフで説明しなくても視聴者の無意識に訴え、意味を与えることができます。\n\nこのようなカットの積み重ねで視聴者の無意識をコントロールすることは、動画編集者の楽しみのひとつです。 興味がある方は、映画における進行方向の演出についての記事をどうぞ\n\nよく考えられている映画では、主人公が右に移動している（右を向いている）ときはストーリーを先に進めている状況、もしくは主人公がポジティブな感情になっています。左…\n\n進行方向以外にも、映画の中の「動き」の演出はたくさんあり、観客の無意識に働きかけています。 塩田明彦監督の「映画術」という著書に詳しいです。とても面白いです。\n\n次回はクリップの挿入、映像と音声の分離についてです。\n\n前回までの Shotcut の使い方 6-1. 関係ない人に見てもらうことは大事 車のシーンの後ろにまだ使っていないクリップを２つ追加で入れたいと思いました。男女が水辺で向か…\n\n前回までの Shotcut の使い方 7-1. クリップの拡大と縮小 追加したクリップのうち、006 だけが他と解像度が異なっているため、上下に黒が出ています。通しで見ると違和感…",
  "tags": []
}