{
  "slug": "shotcuthowto06",
  "title": "無料の動画編集ソフト Shotcut の使い方 06 | 基礎編 5 | クリップの挿入と音声を分離",
  "date": "2024年9月10日",
  "category": "blog",
  "excerpt": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…\n\n前回までの Shotcut の使い方 2-1. 取り込みと各画面の紹介 インストールが完了し、Shotcut の画面が表示されました。最初に編集素材のデータを取り込みます。ご自身の撮…\n\n3-1. テロップを追加する 前回までの Shotcut の使い方 カット編集が終わりました。次はテロップを入れます。ラストの教会のクリップに「終わり」と入れることにします。 …\n\n前回までの Shotcut の使い方 4-1. 音データをタイムラインへ 映像の編集はほぼ固まってきたので、音楽を入れてみます。最初から最後までずっと音楽が流れているようにし…\n\n前回までの Shotcut の使い方 最後の追い込みに入りましょう。エフェクト、トランジション、クリップの差し替えについてです。ここからがクリエイティブと呼ばれる領域だ…\n\n車のシーンの後ろにまだ使っていないクリップを２つ追加で入れたいと思いました。男女が水辺で向かい合っているクリップ（006.mov）と、蚊取り線香のクリップ（009.MTS）です。男が車で向かったあと、二人が落ち合っているショットを入れ込むのをうっかり忘れていました！ 途中まで編集したものを家族に見せた時に指摘されたのです。 どのようなコンテンツでも、完成前、発表前には必ず人に見せて意見をもらいましょう。見てもらうのは、できれば映像制作仲間と、まったく関係ない人（かつ、なかなか褒めてくれない人）の二人がベスト。映像制作関係者は技術的なケチをつけてくれます。まったく関係ない人は、とても素直な意見が聞けます。「なんで二人が会っているシーンがないの？ 教会に行くの早くない？」と言われました。 誰でも自分が作ったものを見てもらうのは恥ずかしいし、否定的なことを言われるのは当人にとって辛いことですが、作品にとっては栄養になります。歯を食いしばって堪えましょう。\n\n最初に二人が見つめ合っているクリップ（006.mov）を追加でタイムラインに取り込みます。 プレイリストから 006.mov をダブルクリックしてビューワー画面に表示させ、使いどころを決めてイン点とアウト点を設定します。 プレイリストの 006.mov をドラッグ・アンド・ドロップでタイムラインに追加します。追加する位置は 002.mp4 の後ろですが、その前にタイムラインの設定を変更します。\n\nタイムライン画面の上部にアイコンが並んでいます。この中の「リップル」「すべてのトラックをリップル」の２つをクリックして有効にしてください。有効になると青緑っぽい色が付きます。無効にするときは再度クリックしてください。 これを行うことで、006.mov を追加した場所以降の全トラックのクリップが後ろにズレてくれます。今までのようにいちいちテロップを修正する必要がなくなり、便利です。さあ、「プレイリスト」から006をドラッグ・アンド・ドロップで挿入してみましょう。\n\nあっ、映像のクリップはテロップも含め自動的に後ろにズレてくれましたが、音楽トラックが分割されてしまい、無音の部分ができてしまいました！\n\nもうひとつ設定を変える必要があったようです。 「元に戻す」をクリックし、クリップ挿入前の状態に戻します。\n\n次に音楽クリップのトラック（A1）のカギのアイコンをクリックして「トラックをロック」してください。 音楽トラックをロックしたのでクリップを挿入しても影響されません。\n\nもう一度挑戦してみましょう。 プレイリストの006.mov をタイムラインにドラッグ・アンド・ドロップしてください。いかがでしょうか？ 新しいクリップは追加され、その分、後ろのクリップはテロップのトラックも含め正常に移動し、音楽は影響を受けませんでした。\n\n次に 009.MTS 蚊取り線香を 006 の後ろに挿入します。もっと夏を強調させたいのです。 プレイリストから009 をダブルクリックしてビューワーに表示させ、イン点とアウト点を決めます。\n\n006のクリップと同様に、タイムラインに挿入します。 使いたいクリップをすべてタイムラインに配置しました。プレビューしてみましょう。\n\n蚊取り線香のクリップには音声がついてることに気づきます。いままでのクリップはすべて音声が入っていなかったので気にならなかったのですが、セミの声は音楽を邪魔してノイズに聞こえます。削除しましょう。\n\nタイムラインで蚊取り線香を選択し、右クリック「音声を分離」を選びます。\n\n蚊取り線香の音声が分離され、新たな音声トラック「A2」に分離された音声が現れました。 しかし、すぐに削除します。\n\n「A2」の音声トラックの上で右クリック「抜き取り」で消えます。\n\n次回、基礎編の最終回。動画の拡大、リップル操作で微調整、完成した作品の書き出し方法です。あと少し！\n\n前回までの Shotcut の使い方 7-1. クリップの拡大と縮小 追加したクリップのうち、006 だけが他と解像度が異なっているため、上下に黒が出ています。通しで見ると違和感…",
  "tags": []
}