{
  "slug": "shotcuthowto04",
  "title": "無料の動画編集ソフト Shotcut の使い方 04 | 基礎編 3 | 音データをタイムラインへ",
  "date": "2024年9月9日",
  "category": "blog",
  "excerpt": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…",
  "image": "https://650vs.com/wp-content/uploads/2024/09/Site_Header_202409.png",
  "content": "1-1. はじめに 無料で使えるソフトはいくつかありますが、私のお勧めは「Shotcut」です。全ての機能が無料で制限なし、幅広い対応コーデックとWindows、MacOS、Linux、Chr…\n\n前回までの Shotcut の使い方 2-1. 取り込みと各画面の紹介 インストールが完了し、Shotcut の画面が表示されました。最初に編集素材のデータを取り込みます。ご自身の撮…\n\n3-1. テロップを追加する 前回までの Shotcut の使い方 カット編集が終わりました。次はテロップを入れます。ラストの教会のクリップに「終わり」と入れることにします。 …\n\n映像の編集はほぼ固まってきたので、音楽を入れてみます。 最初から最後までずっと音楽が流れているようにします。 まずは音楽を配置するための音声トラックを作ります。 タイムラインの三本線から「トラック操作」「音声トラックを追加」をクリック。\n\n新しい音声トラックができました。 V1の下にある「A1」というトラックが音声トラックです。\n\n「プレイリスト」から音楽クリップ 011.mp3 を、タイムラインのA1トラックにドラッグ・アンド・ドロップで配置します。\n\nタイムラインを最初から再生してみましょう。 ちゃんと音楽が聞こえています。でも少し音が大きい気がします。 少し音を小さくして聞きやすくしましょう。\n\n「フィルタを追加」ボタンから...\n\n「音声」にある「ゲイン・音量」をクリックしてください。\n\nここで音量の調節ができます。 レベルというのはボリュームのことだと考えてください。 現在、0dB（デシベル）。これを -18dBくらいにします。 音楽データはだいたい取り込んだ初期状態では音量が大きすぎ、-18dB くらいにするとちょうどいい、というのが動画編集あるあるです。 レベル項目の青い帯をドラッグして左に動かすか、数字をダブルクリックして直接「-18」と入力します。\n\n音量レベル -18 でタイムラインを再生して確認します。 私にはこれくらいの音量がちょうど良いと感じました。 自分が良いと思う音量を見つけましょう。\n\nどうも音楽クリップは映像に対して長いようです。映像がとっくに終わっているのに、音楽はまだ続いています。 音楽クリップを映像の終わりでカットします。 タイムラインの再生ヘッドを映像の終わりに移動させます。 いまさらですが、再生ヘッドというのはタイムラインで再生したときにスーッと左から右にクリップの上を流れていく、えのきだけ1本みたいなもののことです。\n\n音楽クリップを選択した状態で、タイムライン上の「再生ヘッドで分割」ボタンをクリックします。\n\nクリップが分割されました。後ろの不要な部分は右クリック「抜き取り」で削除します。 最初から再生して確認すると、最後、音楽がブツ切りでエレガントではありません。音をフェードアウトさせて、いい雰囲気で終わらせましょう。\n\nタイムラインで音楽クリップを選択し「フィルタ」タブをクリック。 「＋（フィルタを追加）」ボタンから「音声」にある「音声のフェードアウト」をクリックしてください。\n\n自動的にフェードアウトが追加されました。フェードアウトの長さは初期設定で、1秒00フレームです。長さを変えたい時は「長さ」パラメーターで変更します。今回はもう少し長く、2秒00フレームに設定します。数値を直接入力するか、その左隣の「＋」「－」ボタンで変更してください。\n\nフェードアウトの長さを2秒にして、もう一度初めから再生してみます。音楽がフワッと消えていくようになりました。 名作誕生の予感です。\n\nここまでの編集結果を YouTube にアップしています。ご参考ください。\n\n次回はエフェクト、トランジッション、クリップの差し替えついてです。\n\n前回までの Shotcut の使い方 最後の追い込みに入りましょう。エフェクト、トランジション、クリップの差し替えについてです。ここからがクリエイティブと呼ばれる領域だ…\n\n前回までの Shotcut の使い方 6-1. 関係ない人に見てもらうことは大事 車のシーンの後ろにまだ使っていないクリップを２つ追加で入れたいと思いました。男女が水辺で向か…\n\n前回までの Shotcut の使い方 7-1. クリップの拡大と縮小 追加したクリップのうち、006 だけが他と解像度が異なっているため、上下に黒が出ています。通しで見ると違和感…",
  "tags": []
}